Willy319-star/MOCE_SDK_CH32/examples_final/CH32_I2C_gateway_dynamic/main.c
#include "common_can_node.h"
#include "board_pins.h"
#include "mcu_port_i2c.h"
#include "mcu_port_time.h"
#include "vibe_runtime.h"
#include "ch32v20x_can.h"

#include <stdint.h>
#include <string.h>

#define DEVICE_TYPE        DEVICE_TYPE_I2C
#define FW_VERSION         3U
#define NODE_PROTOCOL_VERSION 1U

#define CAP_SCAN           0x01U
#define CAP_PROBE          0x02U
#define CAP_REG_IO         0x04U
#define CAP_RAW_WRITE      0x08U
#define CAP_CHUNK_READ     0x10U
#define CAP_WRITE_READ     0x20U
#define CAP_SET_SPEED      0x40U
#define CAP_DYNAMIC_NODE   0x80U
#define CAPABILITY_FLAGS   (CAP_SCAN | CAP_PROBE | CAP_REG_IO | CAP_RAW_WRITE | CAP_CHUNK_READ | CAP_WRITE_READ | CAP_SET_SPEED | CAP_DYNAMIC_NODE)

#define HEARTBEAT_MS       1000U
#define CAN_POLL_MS        5U

#define NODE_ID_UNASSIGNED 0U
#define NODE_ID_MIN        1U
#define NODE_ID_MAX        127U

#define CAN_ID_DISCOVERY   0x000U

#define DYN_CMD_REQUEST_ID 0xF0U
#define DYN_CMD_ASSIGN_ID  0xF1U
#define DYN_CMD_ID_ACK     0xF2U
#define DYN_CMD_RELEASE_ID 0xF3U
#define DYN_MAGIC0         0xAAU
#define DYN_MAGIC1         0x55U

#define CH32_UID_BASE      0x1FFFF7E8UL

/* Legacy commands kept for compatibility after node assignment. */
#define I2C_CMD_SCAN        0x01U
#define I2C_CMD_PROBE       0x02U
#define I2C_CMD_WRITE_REG   0x03U
#define I2C_CMD_READ_REGS   0x04U

/* Generic transport extensions. */
#define I2C_CMD_WRITE_RAW   0x05U
#define I2C_CMD_WRITE_READ  0x06U
#define I2C_CMD_SET_SPEED   0x07U
#define I2C_CMD_WRITE_MULTI  0x08U

#define I2C_STATUS_SCAN        0x01U
#define I2C_STATUS_PROBE       0x02U
#define I2C_STATUS_WRITE       0x03U
#define I2C_STATUS_READ        0x04U
#define I2C_STATUS_READ_CHUNK  0x05U
#define I2C_STATUS_READ_DONE   0x06U
#define I2C_STATUS_RAW_WRITE   0x07U
#define I2C_STATUS_SPEED       0x08U
#define I2C_STATUS_WRITE_MULTI 0x09U
#define I2C_STATUS_DIAG        0x7EU

#define DIAG_BOOT              0x01U
#define DIAG_RX_CMD            0x02U
#define DIAG_SCAN_START        0x03U
#define DIAG_SCAN_DONE         0x04U
#define DIAG_UNKNOWN_CMD       0x05U
#define DIAG_ASSIGN_DONE       0x06U
#define DIAG_I2C_INIT          0x07U

#define I2C_MAX_WRITE_PAYLOAD  5U
#define I2C_MAX_REG_PAYLOAD    4U
#define I2C_MAX_READ_LEN       32U
#define I2C_READ_CHUNK_LEN     4U
#define I2C_MULTI_CHUNK_MAX    4U
#define I2C_MULTI_BUFFER_LEN   136U
#define I2C_MULTI_FLAG_START   0x01U
#define I2C_MULTI_FLAG_END     0x02U
#define I2C_MULTI_TIMEOUT_MS   1000U
#define ID_ACK_REPEAT_COUNT    3U

#define I2C_SPEED_100K         0U
#define I2C_SPEED_400K         1U

static uint8_t can_ready;
static uint8_t my_node_id = NODE_ID_UNASSIGNED;
static uint8_t id_assigned;
static uint16_t node_token;
static uint8_t request_seq;
static uint8_t diag_seq;

typedef struct {
    uint8_t cmd;
    uint8_t addr;
    uint8_t reg;
    uint8_t data_len;
    uint8_t read_len;
    uint8_t write_len;
    uint8_t speed_code;
    uint8_t request_id;
    uint8_t flags;
    const uint8_t *payload;
    uint8_t payload_len;
} i2c_bridge_cmd_t;

typedef struct {
    uint8_t active;
    uint8_t addr;
    uint8_t len;
    uint8_t overflow;
    uint8_t data[I2C_MULTI_BUFFER_LEN];
} i2c_multi_write_session_t;

static i2c_multi_write_session_t multi_write_session;
static uint32_t multi_write_last_activity_ms;

static mcu_port_i2c_t i2c_bus = {
    .i2c = BOARD_I2C1_INSTANCE,
    .scl_port = BOARD_I2C1_SCL_GPIO_PORT,
    .scl_pin = BOARD_I2C1_SCL_GPIO_PIN,
    .sda_port = BOARD_I2C1_SDA_GPIO_PORT,
    .sda_pin = BOARD_I2C1_SDA_GPIO_PIN,
    .gpio_clock = BOARD_I2C1_GPIO_CLK,
    .i2c_clock = BOARD_I2C1_CLK,
    .speed_hz = 100000U,
    .initialized = 0U,
};

static uint16_t crc16_ccitt_false(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU;
    uint16_t i;
    uint8_t bit;

    for (i = 0U; i < len; ++i) {
        crc ^= (uint16_t)data[i] << 8U;
        for (bit = 0U; bit < 8U; ++bit) {
            crc = ((crc & 0x8000U) != 0U)
                      ? (uint16_t)((crc << 1U) ^ 0x1021U)
                      : (uint16_t)(crc << 1U);
        }
    }
    return crc;
}

static uint16_t read_node_token(void)
{
    const volatile uint8_t *uid = (const volatile uint8_t *)CH32_UID_BASE;
    uint8_t identity[13];
    uint8_t i;
    uint16_t token;

    for (i = 0U; i < 12U; ++i) {
        identity[i] = uid[i];
    }
    identity[12] = DEVICE_TYPE;
    token = crc16_ccitt_false(identity, (uint16_t)sizeof(identity));

    if (token == 0U || token == 0xFFFFU) {
        token = 0x4932U;
    }
    return token;
}

static uint8_t is_valid_node_id(uint8_t node_id)
{
    return (node_id >= NODE_ID_MIN && node_id <= NODE_ID_MAX) ? 1U : 0U;
}


static uint16_t can_filter_std16(uint16_t can_id)
{
    return (uint16_t)((can_id & 0x7FFU) << 5U);
}

static void app_can_filter_config(uint8_t assigned, uint8_t node_id)
{
    CAN_FilterInitTypeDef filter = {0};

    /*
     * Keep filtering open at the application layer.
     *
     * The dynamic gateway must always hear discovery/control frames and the
     * command frame for its assigned node. The previous 16-bit list filter was
     * too fragile on the CH32V20x CAN peripheral: nodes could transmit HELLO
     * after assignment, but did not receive normal I2C command frames such as
     * 0x201/0x202/0x203. The main loop still checks exact CAN IDs before
     * handling frames, so accepting all here is functionally safe and restores
     * multi-node command reception without changing the shared BSP CAN driver.
     */
    (void)assigned;
    (void)node_id;
    (void)can_filter_std16(CAN_ID_DISCOVERY);

    filter.CAN_FilterNumber = 0U;
    filter.CAN_FilterMode = CAN_FilterMode_IdMask;
    filter.CAN_FilterScale = CAN_FilterScale_32bit;
    filter.CAN_FilterIdHigh = 0U;
    filter.CAN_FilterIdLow = 0U;
    filter.CAN_FilterMaskIdHigh = 0U;
    filter.CAN_FilterMaskIdLow = 0U;
    filter.CAN_FilterFIFOAssignment = CAN_Filter_FIFO0;
    filter.CAN_FilterActivation = ENABLE;
    CAN_FilterInit(&filter);
}

static uint8_t parse_i2c_command(const bsp_can_frame_t *frame, i2c_bridge_cmd_t *cmd)
{
    if (frame == 0 || cmd == 0 || frame->dlc < 1U) {
        return 0U;
    }

