Willy319-star/MOCE_SDK_CH32/examples_final/CH32_I2C_gateway_dynamic/main.c
    memset(cmd, 0, sizeof(*cmd));
    cmd->cmd = frame->data[0];

    switch (cmd->cmd) {
    case I2C_CMD_SCAN:
        return 1U;
    case I2C_CMD_PROBE:
        if (frame->dlc < 2U) return 0U;
        cmd->addr = frame->data[1];
        return 1U;
    case I2C_CMD_WRITE_REG:
        if (frame->dlc < 4U) return 0U;
        cmd->addr = frame->data[1];
        cmd->reg = frame->data[2];
        cmd->data_len = frame->data[3];
        cmd->payload = &frame->data[4];
        cmd->payload_len = (frame->dlc > 4U) ? (uint8_t)(frame->dlc - 4U) : 0U;
        return 1U;
    case I2C_CMD_READ_REGS:
        if (frame->dlc < 4U) return 0U;
        cmd->addr = frame->data[1];
        cmd->reg = frame->data[2];
        cmd->read_len = frame->data[3];
        cmd->request_id = (frame->dlc >= 5U) ? frame->data[4] : 0U;
        return 1U;
    case I2C_CMD_WRITE_RAW:
        if (frame->dlc < 3U) return 0U;
        cmd->addr = frame->data[1];
        cmd->data_len = frame->data[2];
        cmd->payload = &frame->data[3];
        cmd->payload_len = (frame->dlc > 3U) ? (uint8_t)(frame->dlc - 3U) : 0U;
        return 1U;
    case I2C_CMD_WRITE_READ:
        if (frame->dlc < 6U) return 0U;
        cmd->addr = frame->data[1];
        cmd->write_len = frame->data[2];
        cmd->read_len = frame->data[3];
        cmd->request_id = frame->data[4];
        cmd->reg = frame->data[5];
        return 1U;
    case I2C_CMD_SET_SPEED:
        if (frame->dlc < 2U) return 0U;
        cmd->speed_code = frame->data[1];
        return 1U;
    case I2C_CMD_WRITE_MULTI:
        if (frame->dlc < 4U) return 0U;
        cmd->addr = frame->data[1];
        cmd->flags = frame->data[2];
        cmd->data_len = frame->data[3];
        cmd->payload = &frame->data[4];
        cmd->payload_len = (frame->dlc > 4U) ? (uint8_t)(frame->dlc - 4U) : 0U;
        return 1U;
    default:
        return 1U;
    }
}

static void send_discovery_frame(uint16_t can_id, uint8_t cmd)
{
    uint8_t data[8] = {0};

    data[0] = cmd;
    data[1] = DEVICE_TYPE;
    data[2] = FW_VERSION;
    data[3] = CAPABILITY_FLAGS;
    data[4] = request_seq;
    data[5] = (uint8_t)(node_token & 0xFFU);
    data[6] = (uint8_t)((node_token >> 8U) & 0xFFU);
    data[7] = my_node_id;
    (void)bsp_can_send_std(can_id, data, sizeof(data));
}

static void send_id_request(void)
{
    request_seq++;
    send_discovery_frame(CAN_ID_DISCOVERY, DYN_CMD_REQUEST_ID);
}

static void send_id_ack(void)
{
    uint8_t data[8] = {0};

    data[0] = DYN_CMD_ID_ACK;
    data[1] = my_node_id;
    data[2] = DYN_MAGIC0;
    data[3] = DYN_MAGIC1;
    data[4] = (uint8_t)(node_token & 0xFFU);
    data[5] = (uint8_t)((node_token >> 8U) & 0xFFU);
    data[6] = DEVICE_TYPE;
    data[7] = FW_VERSION;

    for (uint8_t i = 0U; i < ID_ACK_REPEAT_COUNT; ++i) {
        (void)bsp_can_send_std(CAN_ID_DISCOVERY, data, sizeof(data));
        if (id_assigned) {
            (void)bsp_can_send_std(CAN_ID_STATUS(my_node_id), data, sizeof(data));
        }
    }
}

static void send_node_ack(uint8_t command_type, uint8_t result)
{
    if (id_assigned) {
        (void)node_send_ack(my_node_id, DEVICE_TYPE, command_type, result);
    }
}

static void send_status(uint8_t status_type, const uint8_t *payload, uint8_t payload_len)
{
    uint8_t data[8] = {0};
    uint8_t copy_len = payload_len;

    if (!id_assigned) {
        return;
    }

    data[0] = status_type;
    if (copy_len > 7U) {
        copy_len = 7U;
    }
    if (payload != 0 && copy_len > 0U) {
        memcpy(&data[1], payload, copy_len);
    }

    (void)bsp_can_send_std(CAN_ID_STATUS(my_node_id), data, sizeof(data));
}

static void send_diag(uint8_t stage, uint8_t a, uint8_t b, uint8_t c, uint8_t d)
{
    uint8_t payload[7] = {0};

    payload[0] = stage;
    payload[1] = a;
    payload[2] = b;
    payload[3] = c;
    payload[4] = d;
    payload[5] = diag_seq++;
    payload[6] = my_node_id;
    send_status(I2C_STATUS_DIAG, payload, sizeof(payload));
}

static void send_scan_result(uint8_t found_count, const uint8_t *addresses)
{
    uint8_t payload[7] = {0};
    uint8_t i;
    uint8_t copy_count = found_count;

    if (copy_count > 6U) {
        copy_count = 6U;
    }

    payload[0] = found_count;
    for (i = 0U; i < copy_count; ++i) {
        payload[(uint8_t)(1U + i)] = addresses[i];
    }

    send_status(I2C_STATUS_SCAN, payload, sizeof(payload));
}

static void send_probe_result(uint8_t addr, uint8_t ok)
{
    uint8_t payload[2] = {0};

    payload[0] = addr;
    payload[1] = ok ? 1U : 0U;
    send_status(I2C_STATUS_PROBE, payload, sizeof(payload));
}

static void send_write_result(uint8_t status_type, uint8_t addr, uint8_t reg, uint8_t len, uint8_t ok)
{
    uint8_t payload[4] = {0};

    payload[0] = addr;
    payload[1] = reg;
    payload[2] = len;
    payload[3] = ok ? 1U : 0U;
    send_status(status_type, payload, sizeof(payload));
}

static void send_multi_write_result(uint8_t addr, uint8_t flags, uint8_t buffered_len, uint8_t ok)
{
    uint8_t payload[4] = {0};

    payload[0] = addr;
    payload[1] = flags;
    payload[2] = buffered_len;
    payload[3] = ok ? 1U : 0U;
    send_status(I2C_STATUS_WRITE_MULTI, payload, sizeof(payload));
}

static void send_legacy_read_result(uint8_t addr, uint8_t reg, uint8_t len, uint8_t ok, const uint8_t *read_data)
{
    uint8_t payload[7] = {0};
    uint8_t report_len;
    uint8_t i;

    report_len = ok ? len : 0U;
    if (report_len > I2C_MAX_REG_PAYLOAD) {
        report_len = I2C_MAX_REG_PAYLOAD;
    }

    payload[0] = addr;
    payload[1] = reg;
    payload[2] = report_len;
    payload[3] = ok ? 1U : 0U;
    for (i = 0U; i < report_len; ++i) {
        payload[(uint8_t)(4U + i)] = read_data[i];
    }

    send_status(I2C_STATUS_READ, payload, sizeof(payload));
}

static void send_read_chunks(uint8_t request_id, uint8_t addr, uint8_t reg, uint8_t total_len, uint8_t ok, const uint8_t *read_data)
{
    uint8_t offset = 0U;

    if (!id_assigned) {
        return;
    }

    if (ok) {
        while (offset < total_len) {
            uint8_t data[8] = {0};
            uint8_t chunk_len = (uint8_t)(total_len - offset);
            uint8_t i;

            if (chunk_len > I2C_READ_CHUNK_LEN) {
                chunk_len = I2C_READ_CHUNK_LEN;
            }

            data[0] = I2C_STATUS_READ_CHUNK;
            data[1] = request_id;
            data[2] = offset;
            data[3] = chunk_len;
            for (i = 0U; i < chunk_len; ++i) {
                data[(uint8_t)(4U + i)] = read_data[(uint8_t)(offset + i)];
            }
            (void)bsp_can_send_std(CAN_ID_STATUS(my_node_id), data, sizeof(data));
            offset = (uint8_t)(offset + chunk_len);
        }
    }

    {
        uint8_t done[7] = {0};
        done[0] = request_id;
        done[1] = addr;
        done[2] = reg;
        done[3] = total_len;
        done[4] = ok ? 1U : 0U;
        done[5] = offset;
        send_status(I2C_STATUS_READ_DONE, done, sizeof(done));
    }
}

