Willy319-star/MOCE_SDK_CH32/examples_final/CH32_I2C_gateway_dynamic/main.c
static void handle_scan(void)
{
    uint8_t found[6] = {0};
    uint8_t found_count = 0U;
    uint8_t report_count = 0U;
    uint8_t addr;

    send_diag(DIAG_SCAN_START, 0x03U, 0x77U, 0U, 0U);
    for (addr = 0x03U; addr <= 0x77U; ++addr) {
        if (mcu_port_i2c_is_ready(&i2c_bus, addr)) {
            if (report_count < sizeof(found)) {
                found[report_count] = addr;
                report_count++;
            }
            found_count++;
        }
    }

    send_diag(DIAG_SCAN_DONE, found_count, report_count, found[0], found[1]);
    send_scan_result(found_count, found);
    send_node_ack(I2C_CMD_SCAN, 1U);
}

static void handle_probe(const i2c_bridge_cmd_t *cmd)
{
    uint8_t ok;

    if (cmd == 0) {
        send_node_ack(I2C_CMD_PROBE, 0U);
        return;
    }

    ok = mcu_port_i2c_is_ready(&i2c_bus, cmd->addr);
    send_probe_result(cmd->addr, ok);
    send_node_ack(I2C_CMD_PROBE, ok);
}

static void handle_write_reg(const i2c_bridge_cmd_t *cmd)
{
    uint8_t tx_buf[(uint8_t)(I2C_MAX_REG_PAYLOAD + 1U)] = {0};
    uint8_t ok;

    if (cmd == 0 || cmd->data_len == 0U || cmd->data_len > I2C_MAX_REG_PAYLOAD || cmd->payload_len < cmd->data_len) {
        if (cmd != 0) {
            send_write_result(I2C_STATUS_WRITE, cmd->addr, cmd->reg, cmd->data_len, 0U);
        }
        send_node_ack(I2C_CMD_WRITE_REG, 0U);
        return;
    }

    tx_buf[0] = cmd->reg;
    memcpy(&tx_buf[1], cmd->payload, cmd->data_len);
    ok = mcu_port_i2c_write(&i2c_bus, cmd->addr, tx_buf, (uint16_t)(cmd->data_len + 1U));
    send_write_result(I2C_STATUS_WRITE, cmd->addr, cmd->reg, cmd->data_len, ok);
    send_node_ack(I2C_CMD_WRITE_REG, ok);
}

static void handle_read_regs(const i2c_bridge_cmd_t *cmd)
{
    uint8_t rx_buf[I2C_MAX_READ_LEN] = {0};
    uint8_t ok = 0U;

    if (cmd == 0 || cmd->read_len == 0U || cmd->read_len > I2C_MAX_READ_LEN) {
        if (cmd != 0) {
            send_legacy_read_result(cmd->addr, cmd->reg, cmd->read_len, 0U, rx_buf);
            send_read_chunks(cmd->request_id, cmd->addr, cmd->reg, cmd->read_len, 0U, rx_buf);
        }
        send_node_ack(I2C_CMD_READ_REGS, 0U);
        return;
    }

    for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
        ok = mcu_port_i2c_read_regs(&i2c_bus, cmd->addr, cmd->reg, rx_buf, cmd->read_len);
        if (ok) {
            break;
        }
    }
    if (cmd->read_len <= I2C_MAX_REG_PAYLOAD) {
        send_legacy_read_result(cmd->addr, cmd->reg, cmd->read_len, ok, rx_buf);
    }
    if (cmd->read_len > I2C_MAX_REG_PAYLOAD || cmd->request_id != 0U) {
        send_read_chunks(cmd->request_id, cmd->addr, cmd->reg, cmd->read_len, ok, rx_buf);
    }
    send_node_ack(I2C_CMD_READ_REGS, ok);
}

static void handle_write_raw(const i2c_bridge_cmd_t *cmd)
{
    uint8_t ok;

    if (cmd == 0 || cmd->data_len == 0U || cmd->data_len > I2C_MAX_WRITE_PAYLOAD || cmd->payload_len < cmd->data_len) {
        if (cmd != 0) {
            send_write_result(I2C_STATUS_RAW_WRITE, cmd->addr, 0U, cmd->data_len, 0U);
        }
        send_node_ack(I2C_CMD_WRITE_RAW, 0U);
        return;
    }

    ok = mcu_port_i2c_write(&i2c_bus, cmd->addr, cmd->payload, cmd->data_len);
    send_write_result(I2C_STATUS_RAW_WRITE, cmd->addr, 0U, cmd->data_len, ok);
    send_node_ack(I2C_CMD_WRITE_RAW, ok);
}

static void handle_write_read(const i2c_bridge_cmd_t *cmd)
{
    uint8_t rx_buf[I2C_MAX_READ_LEN] = {0};
    uint8_t ok = 0U;

    if (cmd == 0 || cmd->write_len != 1U || cmd->read_len == 0U || cmd->read_len > I2C_MAX_READ_LEN) {
        if (cmd != 0) {
            send_read_chunks(cmd->request_id, cmd->addr, 0U, cmd->read_len, 0U, rx_buf);
        }
        send_node_ack(I2C_CMD_WRITE_READ, 0U);
        return;
    }

    for (uint8_t attempt = 0U; attempt < 2U; ++attempt) {
        ok = mcu_port_i2c_read_regs(&i2c_bus, cmd->addr, cmd->reg, rx_buf, cmd->read_len);
        if (ok) {
            break;
        }
    }
    if (cmd->read_len <= I2C_MAX_REG_PAYLOAD) {
        send_legacy_read_result(cmd->addr, cmd->reg, cmd->read_len, ok, rx_buf);
    }
    if (cmd->read_len > I2C_MAX_REG_PAYLOAD || cmd->request_id != 0U) {
        send_read_chunks(cmd->request_id, cmd->addr, cmd->reg, cmd->read_len, ok, rx_buf);
    }
    send_node_ack(I2C_CMD_WRITE_READ, ok);
}

static void handle_set_speed(const i2c_bridge_cmd_t *cmd)
{
    uint8_t speed_code;
    uint8_t ok = 0U;
    uint8_t payload[4] = {0};

    if (cmd == 0) {
        send_node_ack(I2C_CMD_SET_SPEED, 0U);
        return;
    }

    speed_code = cmd->speed_code;
    if (speed_code == I2C_SPEED_100K) {
        i2c_bus.speed_hz = 100000U;
        ok = mcu_port_i2c_init(&i2c_bus);
    } else if (speed_code == I2C_SPEED_400K) {
        i2c_bus.speed_hz = 400000U;
        ok = mcu_port_i2c_init(&i2c_bus);
    }

    payload[0] = speed_code;
    payload[1] = ok ? 1U : 0U;
    payload[2] = (uint8_t)(i2c_bus.speed_hz / 1000U);
    send_status(I2C_STATUS_SPEED, payload, sizeof(payload));
    send_node_ack(I2C_CMD_SET_SPEED, ok);
}

static void reset_multi_write_session(void)
{
    memset(&multi_write_session, 0, sizeof(multi_write_session));
    multi_write_last_activity_ms = 0U;
}

static void handle_write_multi(const i2c_bridge_cmd_t *cmd)
{
    uint8_t ok = 0U;
    uint32_t now = mcu_port_millis();

    if (multi_write_session.active &&
        (uint32_t)(now - multi_write_last_activity_ms) > I2C_MULTI_TIMEOUT_MS) {
        send_multi_write_result(multi_write_session.addr, 0U, multi_write_session.len, 0U);
        send_node_ack(I2C_CMD_WRITE_MULTI, 0U);
        reset_multi_write_session();
    }

    if (cmd == 0 || cmd->data_len == 0U || cmd->data_len > I2C_MULTI_CHUNK_MAX || cmd->payload_len < cmd->data_len) {
        if (cmd != 0) {
            send_multi_write_result(cmd->addr, cmd->flags, multi_write_session.len, 0U);
        }
        send_node_ack(I2C_CMD_WRITE_MULTI, 0U);
        return;
    }

    if ((cmd->flags & I2C_MULTI_FLAG_START) != 0U) {
        reset_multi_write_session();
        multi_write_session.active = 1U;
        multi_write_session.addr = cmd->addr;
    }

    if (!multi_write_session.active || multi_write_session.addr != cmd->addr) {
        send_multi_write_result(cmd->addr, cmd->flags, multi_write_session.len, 0U);
        send_node_ack(I2C_CMD_WRITE_MULTI, 0U);
        return;
    }

    multi_write_last_activity_ms = now;

    if ((uint16_t)multi_write_session.len + cmd->data_len > I2C_MULTI_BUFFER_LEN) {
        multi_write_session.overflow = 1U;
        send_multi_write_result(cmd->addr, cmd->flags, multi_write_session.len, 0U);
        send_node_ack(I2C_CMD_WRITE_MULTI, 0U);
        reset_multi_write_session();
        return;
    }

