Willy319-star/MOCE_SDK_CH32/examples_final/CH32_I2C_gateway_dynamic/main.c
    memcpy(&multi_write_session.data[multi_write_session.len], cmd->payload, cmd->data_len);
    multi_write_session.len = (uint8_t)(multi_write_session.len + cmd->data_len);

    if ((cmd->flags & I2C_MULTI_FLAG_END) != 0U) {
        if (multi_write_session.len > 0U) {
            ok = mcu_port_i2c_write(&i2c_bus, multi_write_session.addr, multi_write_session.data, multi_write_session.len);
        }
        send_multi_write_result(cmd->addr, cmd->flags, multi_write_session.len, ok);
        send_node_ack(I2C_CMD_WRITE_MULTI, ok);
        reset_multi_write_session();
    } else {
        send_multi_write_result(cmd->addr, cmd->flags, multi_write_session.len, 1U);
        send_node_ack(I2C_CMD_WRITE_MULTI, 1U);
    }
}

static uint8_t frame_token_matches(const bsp_can_frame_t *frame)
{
    uint16_t token;

    if (frame == 0 || frame->dlc < 6U) {
        return 0U;
    }

    token = node_get_u16_le(frame->data, 4U);
    return (token == node_token) ? 1U : 0U;
}

static void handle_assign_id(const bsp_can_frame_t *frame)
{
    uint8_t new_node_id;

    if (frame == 0 || frame->dlc < 8U) {
        return;
    }
    if (frame->data[0] != DYN_CMD_ASSIGN_ID || frame->data[2] != DYN_MAGIC0 || frame->data[3] != DYN_MAGIC1) {
        return;
    }
    if (frame->data[6] != DEVICE_TYPE ||
        frame->data[7] != NODE_PROTOCOL_VERSION) {
        return;
    }
    if (!frame_token_matches(frame)) {
        return;
    }

    new_node_id = frame->data[1];
    if (!is_valid_node_id(new_node_id)) {
        return;
    }

    my_node_id = new_node_id;
    id_assigned = 1U;
    app_can_filter_config(1U, my_node_id);
    send_id_ack();
    send_diag(DIAG_ASSIGN_DONE, my_node_id, (uint8_t)(node_token & 0xFFU), (uint8_t)((node_token >> 8U) & 0xFFU), 0U);
    (void)node_send_hello(my_node_id, DEVICE_TYPE, FW_VERSION, CAPABILITY_FLAGS);
}

static void handle_discovery_frame(const bsp_can_frame_t *frame)
{
    if (frame == 0 || frame->dlc < 1U) {
        return;
    }

    if (frame->data[0] == DYN_CMD_RELEASE_ID) {
        if (frame->dlc >= 3U && frame->data[1] == DYN_MAGIC0 && frame->data[2] == DYN_MAGIC1) {
            my_node_id = NODE_ID_UNASSIGNED;
            id_assigned = 0U;
            app_can_filter_config(0U, NODE_ID_UNASSIGNED);
            send_id_request();
        }
    } else if (frame->data[0] == DYN_CMD_ASSIGN_ID) {
        handle_assign_id(frame);
    } else if (frame->data[0] == DYN_CMD_REQUEST_ID) {
        if (id_assigned) {
            send_id_ack();
            (void)node_send_hello(my_node_id, DEVICE_TYPE, FW_VERSION, CAPABILITY_FLAGS);
        } else {
            send_id_request();
        }
    }
}
static void heartbeat_task(void)
{
    if (!can_ready) {
        return;
    }

    if (id_assigned) {
        (void)node_send_hello(my_node_id, DEVICE_TYPE, FW_VERSION, CAPABILITY_FLAGS);
    } else {
        send_id_request();
    }
}

static void handle_i2c_command(const bsp_can_frame_t *frame)
{
    i2c_bridge_cmd_t cmd;

    if (frame == 0 || frame->dlc < 1U) {
        return;
    }

    send_diag(DIAG_RX_CMD, frame->data[0], frame->dlc, (uint8_t)(frame->id & 0xFFU), (uint8_t)((frame->id >> 8U) & 0xFFU));
    if (!parse_i2c_command(frame, &cmd)) {
        send_diag(DIAG_UNKNOWN_CMD, frame->data[0], frame->dlc, 0U, 0U);
        send_node_ack(frame->data[0], 0U);
        return;
    }

    switch (cmd.cmd) {
    case I2C_CMD_SCAN:
        handle_scan();
        break;
    case I2C_CMD_PROBE:
        handle_probe(&cmd);
        break;
    case I2C_CMD_WRITE_REG:
        handle_write_reg(&cmd);
        break;
    case I2C_CMD_READ_REGS:
        handle_read_regs(&cmd);
        break;
    case I2C_CMD_WRITE_RAW:
        handle_write_raw(&cmd);
        break;
    case I2C_CMD_WRITE_READ:
        handle_write_read(&cmd);
        break;
    case I2C_CMD_SET_SPEED:
        handle_set_speed(&cmd);
        break;
    case I2C_CMD_WRITE_MULTI:
        handle_write_multi(&cmd);
        break;
    default:
        send_diag(DIAG_UNKNOWN_CMD, cmd.cmd, frame->dlc, 0U, 0U);
        send_node_ack(cmd.cmd, 0U);
        break;
    }
}

static void can_poll_task(void)
{
    bsp_can_frame_t frame;

    if (!can_ready) {
        return;
    }

    while (bsp_can_receive(&frame)) {
        if (frame.id == CAN_ID_DISCOVERY) {
            handle_discovery_frame(&frame);
            continue;
        }

        if (!id_assigned) {
            continue;
        }

        if (frame.id == CAN_ID_I2C_CMD(my_node_id)) {
            handle_i2c_command(&frame);
        }
    }
}

void app_setup(void)
{
    node_token = read_node_token();
    (void)mcu_port_i2c_init(&i2c_bus);
    can_ready = bsp_can_init(BSP_CAN_BITRATE_500K);
    if (can_ready) {
        app_can_filter_config(0U, NODE_ID_UNASSIGNED);
    }

    heartbeat_task();
    (void)vibe_task_every_ms(HEARTBEAT_MS, heartbeat_task);
    (void)vibe_task_every_ms(CAN_POLL_MS, can_poll_task);
}
